[Killed] StringLiteral
Workspace/employed/controllers/employee.controller.js:1:31
-const employeeModel = require('../models/employee.model');
+const employeeModel = require("");
 const joi = require('@hapi/joi');
 const bcrypt = require('bcrypt');

[Killed] StringLiteral
Workspace/employed/controllers/employee.controller.js:4:21
 const employeeModel = require('../models/employee.model');
 const joi = require('@hapi/joi');
 const bcrypt = require('bcrypt');
-const jwt = require('jsonwebtoken');
+const jwt = require("");
 
 const SALT_ROUNDS = 10;

[Killed] BlockStatement
Workspace/employed/controllers/employee.controller.js:16:50
   phone: joi.string(),
 });
 
-const createEmployee = async (req, res, next) => {
-  try {
-    const joiCheck = schema.validate(req.body);
-    if (joiCheck.error) {
-      return res.status(400).json(joiCheck.error);
-    }
-    const emailExists = await employeeModel.findOne({
-      email: req.body.email,
-    });
-    if (emailExists) {
-      return res.status(400).json('The email you provided already exists in our database.');
-    }
-
-    const salt = await bcrypt.genSalt(SALT_ROUNDS);
-    const encryptedPassword = await bcrypt.hash(req.body.password, salt);
-    req.body.password = encryptedPassword;
-    const employee = await employeeModel.create(req.body);
-    res.status(201).json(employee);
-  } catch (error) {
-    console.log(error);
-    res.status(500).json(error)
-  }
-};
+const createEmployee = async (req, res, next) => {};
 
 const getAllEmployees = async (req, res, next) => {

[Killed] BlockStatement
Workspace/employed/controllers/employee.controller.js:17:7
 });
 
 const createEmployee = async (req, res, next) => {
-  try {
-    const joiCheck = schema.validate(req.body);
-    if (joiCheck.error) {
-      return res.status(400).json(joiCheck.error);
-    }
-    const emailExists = await employeeModel.findOne({
-      email: req.body.email,
-    });
-    if (emailExists) {
-      return res.status(400).json('The email you provided already exists in our database.');
-    }
-
-    const salt = await bcrypt.genSalt(SALT_ROUNDS);
-    const encryptedPassword = await bcrypt.hash(req.body.password, salt);
-    req.body.password = encryptedPassword;
-    const employee = await employeeModel.create(req.body);
-    res.status(201).json(employee);
-  } catch (error) {
+  try {} catch (error) {
     console.log(error);
     res.status(500).json(error)

[Killed] ConditionalExpression
Workspace/employed/controllers/employee.controller.js:19:9
 const createEmployee = async (req, res, next) => {
   try {
     const joiCheck = schema.validate(req.body);
-    if (joiCheck.error) {
+    if (true) {
       return res.status(400).json(joiCheck.error);
     }

[Survived] BlockStatement
Workspace/employed/controllers/employee.controller.js:19:25
 const createEmployee = async (req, res, next) => {
   try {
     const joiCheck = schema.validate(req.body);
-    if (joiCheck.error) {
-      return res.status(400).json(joiCheck.error);
-    }
+    if (joiCheck.error) {}
     const emailExists = await employeeModel.findOne({
       email: req.body.email,

[Killed] BlockStatement
Workspace/employed/controllers/employee.controller.js:25:22
     const emailExists = await employeeModel.findOne({
       email: req.body.email,
     });
-    if (emailExists) {
-      return res.status(400).json('The email you provided already exists in our database.');
-    }
+    if (emailExists) {}
 
     const salt = await bcrypt.genSalt(SALT_ROUNDS);

[Killed] ConditionalExpression
Workspace/employed/controllers/employee.controller.js:25:9
     const emailExists = await employeeModel.findOne({
       email: req.body.email,
     });
-    if (emailExists) {
+    if (false) {
       return res.status(400).json('The email you provided already exists in our database.');
     }

[Killed] BlockStatement
Workspace/employed/controllers/employee.controller.js:34:19
     req.body.password = encryptedPassword;
     const employee = await employeeModel.create(req.body);
     res.status(201).json(employee);
-  } catch (error) {
-    console.log(error);
-    res.status(500).json(error)
-  }
+  } catch (error) {}
 };
 

[Killed] BlockStatement
Workspace/employed/controllers/employee.controller.js:40:51
   }
 };
 
-const getAllEmployees = async (req, res, next) => {
-  try {
-    const employees = await employeeModel.find({});
-    if (employees && employees.length) {
-      res.status(200).json(employees);
-    } else {
-      res.status(404).json();
-    }
-  } catch (error) {
-    res.status(500).json(error);
-  }
-};
+const getAllEmployees = async (req, res, next) => {};
 
 const getEmployeeById = async (req, res, next) => {

[Killed] BlockStatement
Workspace/employed/controllers/employee.controller.js:41:7
 };
 
 const getAllEmployees = async (req, res, next) => {
-  try {
-    const employees = await employeeModel.find({});
-    if (employees && employees.length) {
-      res.status(200).json(employees);
-    } else {
-      res.status(404).json();
-    }
-  } catch (error) {
+  try {} catch (error) {
     res.status(500).json(error);
   }

[Killed] BlockStatement
Workspace/employed/controllers/employee.controller.js:43:40
 const getAllEmployees = async (req, res, next) => {
   try {
     const employees = await employeeModel.find({});
-    if (employees && employees.length) {
-      res.status(200).json(employees);
-    } else {
+    if (employees && employees.length) {} else {
       res.status(404).json();
     }

[Killed] ConditionalExpression
Workspace/employed/controllers/employee.controller.js:43:9
 const getAllEmployees = async (req, res, next) => {
   try {
     const employees = await employeeModel.find({});
-    if (employees && employees.length) {
+    if (false) {
       res.status(200).json(employees);
     } else {

[Killed] BlockStatement
Workspace/employed/controllers/employee.controller.js:45:12
     const employees = await employeeModel.find({});
     if (employees && employees.length) {
       res.status(200).json(employees);
-    } else {
-      res.status(404).json();
-    }
+    } else {}
   } catch (error) {
     res.status(500).json(error);

[Killed] BlockStatement
Workspace/employed/controllers/employee.controller.js:48:19
     } else {
       res.status(404).json();
     }
-  } catch (error) {
-    res.status(500).json(error);
-  }
+  } catch (error) {}
 };
 

[Killed] BlockStatement
Workspace/employed/controllers/employee.controller.js:53:51
   }
 };
 
-const getEmployeeById = async (req, res, next) => {
-  try {
-    const employee = await employeeModel.findById(req.params.id);
-    if (employee) {
-      res.status(200).json(employee);
-    } else {
-      res.status(404).json();
-    }
-  } catch (error) {
-    res.status(500).json(error);
-  }
-};
+const getEmployeeById = async (req, res, next) => {};
 
 const updateEmployeeById = async (req, res, next) => {

[Killed] BlockStatement
Workspace/employed/controllers/employee.controller.js:54:7
 };
 
 const getEmployeeById = async (req, res, next) => {
-  try {
-    const employee = await employeeModel.findById(req.params.id);
-    if (employee) {
-      res.status(200).json(employee);
-    } else {
-      res.status(404).json();
-    }
-  } catch (error) {
+  try {} catch (error) {
     res.status(500).json(error);
   }

[Killed] ConditionalExpression
Workspace/employed/controllers/employee.controller.js:56:9
 const getEmployeeById = async (req, res, next) => {
   try {
     const employee = await employeeModel.findById(req.params.id);
-    if (employee) {
+    if (false) {
       res.status(200).json(employee);
     } else {

[Killed] BlockStatement
Workspace/employed/controllers/employee.controller.js:56:19
 const getEmployeeById = async (req, res, next) => {
   try {
     const employee = await employeeModel.findById(req.params.id);
-    if (employee) {
-      res.status(200).json(employee);
-    } else {
+    if (employee) {} else {
       res.status(404).json();
     }

[Killed] BlockStatement
Workspace/employed/controllers/employee.controller.js:58:12
     const employee = await employeeModel.findById(req.params.id);
     if (employee) {
       res.status(200).json(employee);
-    } else {
-      res.status(404).json();
-    }
+    } else {}
   } catch (error) {
     res.status(500).json(error);

[Killed] BlockStatement
Workspace/employed/controllers/employee.controller.js:66:54
   }
 };
 
-const updateEmployeeById = async (req, res, next) => {
-  try {
-    const employee = await employeeModel.findByIdAndUpdate(
-      req.params.id,
-      req.body,
-      {
-        useFindAndModify: false,
-      },
-    );
-    if (employee) {
-      res.status(201).json(employee);
-    } else {
-      res.status(400).json({});
-    }
-  } catch (error) {
-    // console.log(error);
-    res.status(500).json(error);
-  }
-};
+const updateEmployeeById = async (req, res, next) => {};
 
 const deleteEmployeeById = async (req, res, next) => {

[Killed] BlockStatement
Workspace/employed/controllers/employee.controller.js:67:7
 };
 
 const updateEmployeeById = async (req, res, next) => {
-  try {
-    const employee = await employeeModel.findByIdAndUpdate(
-      req.params.id,
-      req.body,
-      {
-        useFindAndModify: false,
-      },
-    );
-    if (employee) {
-      res.status(201).json(employee);
-    } else {
-      res.status(400).json({});
-    }
-  } catch (error) {
+  try {} catch (error) {
     // console.log(error);
     res.status(500).json(error);

[Killed] BlockStatement
Workspace/employed/controllers/employee.controller.js:75:19
         useFindAndModify: false,
       },
     );
-    if (employee) {
-      res.status(201).json(employee);
-    } else {
+    if (employee) {} else {
       res.status(400).json({});
     }

[Killed] ConditionalExpression
Workspace/employed/controllers/employee.controller.js:75:9
         useFindAndModify: false,
       },
     );
-    if (employee) {
+    if (true) {
       res.status(201).json(employee);
     } else {

[Killed] BlockStatement
Workspace/employed/controllers/employee.controller.js:77:12
     );
     if (employee) {
       res.status(201).json(employee);
-    } else {
-      res.status(400).json({});
-    }
+    } else {}
   } catch (error) {
     // console.log(error);

[Killed] BlockStatement
Workspace/employed/controllers/employee.controller.js:80:19
     } else {
       res.status(400).json({});
     }
-  } catch (error) {
-    // console.log(error);
-    res.status(500).json(error);
-  }
+  } catch (error) {}
 };
 

[Killed] BlockStatement
Workspace/employed/controllers/employee.controller.js:86:54
   }
 };
 
-const deleteEmployeeById = async (req, res, next) => {
-  try {
-    const results = await employeeModel.findByIdAndDelete(req.params.id);
-    if (results) {
-      res.status(200).json(results);
-    } else {
-      res.status(404).json('User Not Found');
-    }
-  } catch (error) {
-    res.status(500).json(error);
-  }
-};
+const deleteEmployeeById = async (req, res, next) => {};
 
 const loginEmployee = async (req, res, next) => {

[Killed] BlockStatement
Workspace/employed/controllers/employee.controller.js:87:7
 };
 
 const deleteEmployeeById = async (req, res, next) => {
-  try {
-    const results = await employeeModel.findByIdAndDelete(req.params.id);
-    if (results) {
-      res.status(200).json(results);
-    } else {
-      res.status(404).json('User Not Found');
-    }
-  } catch (error) {
+  try {} catch (error) {
     res.status(500).json(error);
   }

[Killed] BlockStatement
Workspace/employed/controllers/employee.controller.js:89:18
 const deleteEmployeeById = async (req, res, next) => {
   try {
     const results = await employeeModel.findByIdAndDelete(req.params.id);
-    if (results) {
-      res.status(200).json(results);
-    } else {
+    if (results) {} else {
       res.status(404).json('User Not Found');
     }

[Killed] ConditionalExpression
Workspace/employed/controllers/employee.controller.js:89:9
 const deleteEmployeeById = async (req, res, next) => {
   try {
     const results = await employeeModel.findByIdAndDelete(req.params.id);
-    if (results) {
+    if (false) {
       res.status(200).json(results);
     } else {

[Killed] BlockStatement
Workspace/employed/controllers/employee.controller.js:91:12
     const results = await employeeModel.findByIdAndDelete(req.params.id);
     if (results) {
       res.status(200).json(results);
-    } else {
-      res.status(404).json('User Not Found');
-    }
+    } else {}
   } catch (error) {
     res.status(500).json(error);

[Killed] BlockStatement
Workspace/employed/controllers/employee.controller.js:100:7
 };
 
 const loginEmployee = async (req, res, next) => {
-  try {
-    const joiCheck = schema.validate(req.body);
-    if (joiCheck.error) {
-      return res.status(400).json(joiCheck.error);
-    }
-    const employee = await employeeModel.findOne({
-      email: req.body.email,
-    });
-    if (!employee) {
-      return res.status(400).json('The email you provided does not exist in our database.');
-    }
-    
-    const validPassword = await bcrypt.compare(req.body.password, employee.password);
-    if (!validPassword) {
-      return res.status(400).json('You provided an invalid password.Please try again.');
-    }
-    const token = await jwt.sign({
-      data: employee,
-    }, process.env.JWT_SECRET, { expiresIn: '1h' });
-    res.header('auth-token', token);
-    res.status(201).json(employee);
-  } catch (error) {
+  try {} catch (error) {
     res.status(500).json(error);
   }

[Survived] ConditionalExpression
Workspace/employed/controllers/employee.controller.js:102:9
 const loginEmployee = async (req, res, next) => {
   try {
     const joiCheck = schema.validate(req.body);
-    if (joiCheck.error) {
+    if (false) {
       return res.status(400).json(joiCheck.error);
     }

[Killed] BooleanLiteral
Workspace/employed/controllers/employee.controller.js:108:9
     const employee = await employeeModel.findOne({
       email: req.body.email,
     });
-    if (!employee) {
+    if (employee) {
       return res.status(400).json('The email you provided does not exist in our database.');
     }

[Killed] ConditionalExpression
Workspace/employed/controllers/employee.controller.js:108:9
     const employee = await employeeModel.findOne({
       email: req.body.email,
     });
-    if (!employee) {
+    if (true) {
       return res.status(400).json('The email you provided does not exist in our database.');
     }

[Killed] ConditionalExpression
Workspace/employed/controllers/employee.controller.js:113:9
     }
     
     const validPassword = await bcrypt.compare(req.body.password, employee.password);
-    if (!validPassword) {
+    if (true) {
       return res.status(400).json('You provided an invalid password.Please try again.');
     }

[Killed] BooleanLiteral
Workspace/employed/controllers/employee.controller.js:113:9
     }
     
     const validPassword = await bcrypt.compare(req.body.password, employee.password);
-    if (!validPassword) {
+    if (validPassword) {
       return res.status(400).json('You provided an invalid password.Please try again.');
     }

[Survived] StringLiteral
Workspace/employed/controllers/employee.controller.js:114:35
     
     const validPassword = await bcrypt.compare(req.body.password, employee.password);
     if (!validPassword) {
-      return res.status(400).json('You provided an invalid password.Please try again.');
+      return res.status(400).json("");
     }
     const token = await jwt.sign({

[Killed] StringLiteral
Workspace/employed/controllers/employee.controller.js:119:16
     const token = await jwt.sign({
       data: employee,
     }, process.env.JWT_SECRET, { expiresIn: '1h' });
-    res.header('auth-token', token);
+    res.header("", token);
     res.status(201).json(employee);
   } catch (error) {

[Killed] BlockStatement
Workspace/employed/controllers/employee.controller.js:121:19
     }, process.env.JWT_SECRET, { expiresIn: '1h' });
     res.header('auth-token', token);
     res.status(201).json(employee);
-  } catch (error) {
-    res.status(500).json(error);
-  }
+  } catch (error) {}
 };
 
